betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_dma.c
/**
  *
  * @file    apm32f4xx_ddl_dma.c
  * @brief   DMA DDL module driver.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  */
#if defined(USE_FULL_DDL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_ddl_dma.h"
#include "apm32f4xx_ddl_bus.h"

#ifdef  USE_FULL_ASSERT
  #include "apm32_assert.h"
#else
#ifndef ASSERT_PARAM
    #define ASSERT_PARAM(_PARAM_) ((void)(0U))
#endif
#endif

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (DMA1) || defined (DMA2)

/** @defgroup DMA_DDL DMA
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup DMA_DDL_Private_Macros
  * @{
  */
#define IS_DDL_DMA_DIRECTION(__VALUE__)          (((__VALUE__) == DDL_DMA_DIRECTION_PERIPH_TO_MEMORY) || \
                                                 ((__VALUE__) == DDL_DMA_DIRECTION_MEMORY_TO_PERIPH) || \
                                                 ((__VALUE__) == DDL_DMA_DIRECTION_MEMORY_TO_MEMORY))

#if defined (DMA_SCFGx_PERFC)
#define IS_DDL_DMA_MODE(__VALUE__)               (((__VALUE__) == DDL_DMA_MODE_NORMAL)    || \
                                                 ((__VALUE__) == DDL_DMA_MODE_CIRCULAR)  || \
                                                 ((__VALUE__) == DDL_DMA_MODE_PFCTRL))
#else
#define IS_DDL_DMA_MODE(__VALUE__)               (((__VALUE__) == DDL_DMA_MODE_NORMAL)    || \
                                                 ((__VALUE__) == DDL_DMA_MODE_CIRCULAR))
#endif /* DMA_SCFGx_PERFC */

#define IS_DDL_DMA_PERIPHINCMODE(__VALUE__)      (((__VALUE__) == DDL_DMA_PERIPH_INCREMENT) || \
                                                 ((__VALUE__) == DDL_DMA_PERIPH_NOINCREMENT))

#define IS_DDL_DMA_MEMORYINCMODE(__VALUE__)      (((__VALUE__) == DDL_DMA_MEMORY_INCREMENT) || \
                                                 ((__VALUE__) == DDL_DMA_MEMORY_NOINCREMENT))

#define IS_DDL_DMA_PERIPHDATASIZE(__VALUE__)     (((__VALUE__) == DDL_DMA_PDATAALIGN_BYTE)      || \
                                                 ((__VALUE__) == DDL_DMA_PDATAALIGN_HALFWORD)  || \
                                                 ((__VALUE__) == DDL_DMA_PDATAALIGN_WORD))

#define IS_DDL_DMA_MEMORYDATASIZE(__VALUE__)     (((__VALUE__) == DDL_DMA_MDATAALIGN_BYTE)      || \
                                                 ((__VALUE__) == DDL_DMA_MDATAALIGN_HALFWORD)  || \
                                                 ((__VALUE__) == DDL_DMA_MDATAALIGN_WORD))

#define IS_DDL_DMA_NBDATA(__VALUE__)             ((__VALUE__)  <= 0x0000FFFFU)

#define IS_DDL_DMA_CHANNEL(__VALUE__)            (((__VALUE__) == DDL_DMA_CHANNEL_0)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_1)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_2)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_3)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_4)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_5)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_6)  || \
                                                 ((__VALUE__) == DDL_DMA_CHANNEL_7))

#define IS_DDL_DMA_PRIORITY(__VALUE__)           (((__VALUE__) == DDL_DMA_PRIORITY_LOW)    || \
                                                 ((__VALUE__) == DDL_DMA_PRIORITY_MEDIUM) || \
                                                 ((__VALUE__) == DDL_DMA_PRIORITY_HIGH)   || \
                                                 ((__VALUE__) == DDL_DMA_PRIORITY_VERYHIGH))

#define IS_DDL_DMA_ALL_STREAM_INSTANCE(INSTANCE, STREAM)   ((((INSTANCE) == DMA1) && \
                                                           (((STREAM) == DDL_DMA_STREAM_0) || \
                                                            ((STREAM) == DDL_DMA_STREAM_1) || \
                                                            ((STREAM) == DDL_DMA_STREAM_2) || \
                                                            ((STREAM) == DDL_DMA_STREAM_3) || \
                                                            ((STREAM) == DDL_DMA_STREAM_4) || \
                                                            ((STREAM) == DDL_DMA_STREAM_5) || \
                                                            ((STREAM) == DDL_DMA_STREAM_6) || \
                                                            ((STREAM) == DDL_DMA_STREAM_7) || \
                                                            ((STREAM) == DDL_DMA_STREAM_ALL))) ||\
                                                            (((INSTANCE) == DMA2) && \
                                                          (((STREAM) == DDL_DMA_STREAM_0) || \
                                                           ((STREAM) == DDL_DMA_STREAM_1) || \
                                                           ((STREAM) == DDL_DMA_STREAM_2) || \
                                                           ((STREAM) == DDL_DMA_STREAM_3) || \
                                                           ((STREAM) == DDL_DMA_STREAM_4) || \
                                                           ((STREAM) == DDL_DMA_STREAM_5) || \
                                                           ((STREAM) == DDL_DMA_STREAM_6) || \
                                                           ((STREAM) == DDL_DMA_STREAM_7) || \
                                                           ((STREAM) == DDL_DMA_STREAM_ALL))))

#define IS_DDL_DMA_ALL_CHANNEL_INSTANCE(INSTANCE, CHANNEL)  ((((INSTANCE) == DMA1) && \
                                                            (((CHANNEL) == DDL_DMA_CHANNEL_1) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_2) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_3) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_4) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_5) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_6) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_7))) || \
                                                            (((INSTANCE) == DMA2) && \
                                                            (((CHANNEL) == DDL_DMA_CHANNEL_1) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_2) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_3) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_4) || \
                                                             ((CHANNEL) == DDL_DMA_CHANNEL_5))))

#define IS_DDL_DMA_FIFO_MODE_STATE(STATE) (((STATE) == DDL_DMA_FIFOMODE_DISABLE ) || \
                                          ((STATE) == DDL_DMA_FIFOMODE_ENABLE))

