betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_dma.c
    /* Reset DMAx_Channely configuration register */
    DDL_DMA_WriteReg(tmp, CHCFG, 0U);

    /* Reset DMAx_Channely remaining bytes register */
    DDL_DMA_WriteReg(tmp, CHNDATA, 0U);

    /* Reset DMAx_Channely peripheral address register */
    DDL_DMA_WriteReg(tmp, CHPADDR, 0U);

    /* Reset DMAx_Channely memory address register */
    DDL_DMA_WriteReg(tmp, CHMADDR, 0U);

    if(Channel == DDL_DMA_CHANNEL_1)
    {
       /* Reset the DMAx Channel1 pending flags */
       DDL_DMA_ClearFlag_GI1(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_2)
    {
       /* Reset the DMAx Channel2 pending flags */
       DDL_DMA_ClearFlag_GI2(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_3)
    {
       /* Reset the DMAx Channel3 pending flags */
       DDL_DMA_ClearFlag_GI3(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_4)
    {
       /* Reset the DMAx Channel4 pending flags */
       DDL_DMA_ClearFlag_GI4(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_5)
    {
       /* Reset the DMAx Channel5 pending flags */
       DDL_DMA_ClearFlag_GI5(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_6)
    {
       /* Reset the DMAx Channel6 pending flags */
       DDL_DMA_ClearFlag_GI6(DMAx);
    }
    else if(Channel == DDL_DMA_CHANNEL_7)
    {
       /* Reset the DMAx Channel7 pending flags */
       DDL_DMA_ClearFlag_GI7(DMAx);
    }
    else
    {
      status = ERROR;
    }
  }

  return status;
}

/**
  * @brief  Initialize the DMA registers according to the specified parameters in DMA_InitStruct.
  * @note   To convert DMAx_Streamy Instance to DMAx Instance and Streamy, use helper macros :
  *         @arg @ref __DDL_DMA_GET_INSTANCE
  *         @arg @ref __DDL_DMA_GET_STREAM
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref DDL_DMA_CHANNEL_1
  *         @arg @ref DDL_DMA_CHANNEL_2
  *         @arg @ref DDL_DMA_CHANNEL_3
  *         @arg @ref DDL_DMA_CHANNEL_4
  *         @arg @ref DDL_DMA_CHANNEL_5
  *         @arg @ref DDL_DMA_CHANNEL_6
  *         @arg @ref DDL_DMA_CHANNEL_7
  * @param  DMA_InitStruct pointer to a @ref DDL_DMA_InitTypeDef structure.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: DMA registers are initialized
  *          - ERROR: Not applicable
  */
uint32_t DDL_DMA_Init(DMA_TypeDef *DMAx, uint32_t Channel, DDL_DMA_InitTypeDef *DMA_InitStruct)
{
  /* Check the DMA Instance DMAx and Channel parameters*/
  ASSERT_PARAM(IS_DDL_DMA_ALL_CHANNEL_INSTANCE(DMAx, Channel));

  /* Check the DMA parameters from DMA_InitStruct */
  ASSERT_PARAM(IS_DDL_DMA_DIRECTION(DMA_InitStruct->Direction));
  ASSERT_PARAM(IS_DDL_DMA_MODE(DMA_InitStruct->Mode));
  ASSERT_PARAM(IS_DDL_DMA_PERIPHINCMODE(DMA_InitStruct->PeriphOrM2MSrcIncMode));
  ASSERT_PARAM(IS_DDL_DMA_MEMORYINCMODE(DMA_InitStruct->MemoryOrM2MDstIncMode));
  ASSERT_PARAM(IS_DDL_DMA_PERIPHDATASIZE(DMA_InitStruct->PeriphOrM2MSrcDataSize));
  ASSERT_PARAM(IS_DDL_DMA_MEMORYDATASIZE(DMA_InitStruct->MemoryOrM2MDstDataSize));
  ASSERT_PARAM(IS_DDL_DMA_NBDATA(DMA_InitStruct->NbData));
  ASSERT_PARAM(IS_DDL_DMA_PRIORITY(DMA_InitStruct->Priority));

  /*---------------------------- DMAx CHCFGx Configuration ------------------------
   * Configure DMAx_Channely: data transfer direction, data transfer mode,
   *                          peripheral and memory increment mode,
   *                          data size alignment and  priority level with parameters :
   * - Direction:      DMA_CHCFGx_DIRCFG and DMA_CHCFGx_M2MMODE bits
   * - Mode:           DMA_CHCFGx_CIRMODE bit
   * - PeriphOrM2MSrcIncMode:  DMA_CHCFGx_PERIMODE bit
   * - MemoryOrM2MDstIncMode:  DMA_CHCFGx_MIMODE bit
   * - PeriphOrM2MSrcDataSize: DMA_CHCFGx_PERSIZE[1:0] bits
   * - MemoryOrM2MDstDataSize: DMA_CHCFGx_MEMSIZE[1:0] bits
   * - Priority:               DMA_CHCFGx_CHPL[1:0] bits
   */
  DDL_DMA_ConfigTransfer(DMAx, Channel, DMA_InitStruct->Direction | \
                        DMA_InitStruct->Mode                    | \
                        DMA_InitStruct->PeriphOrM2MSrcIncMode   | \
                        DMA_InitStruct->MemoryOrM2MDstIncMode   | \
                        DMA_InitStruct->PeriphOrM2MSrcDataSize  | \
                        DMA_InitStruct->MemoryOrM2MDstDataSize  | \
                        DMA_InitStruct->Priority);

  /*-------------------------- DMAx CHMADDRx Configuration --------------------------
   * Configure the memory or destination base address with parameter :
   * - MemoryOrM2MDstAddress:     DMA_CHMADDRx_MEMADDR[31:0] bits
   */
  DDL_DMA_SetMemoryAddress(DMAx, Channel, DMA_InitStruct->MemoryOrM2MDstAddress);

  /*-------------------------- DMAx CHPADDRx Configuration ---------------------------
   * Configure the peripheral or source base address with parameter :
   * - PeriphOrM2MSrcAddress:     DMA_CHPADDRx_PERADDR[31:0] bits
   */
  DDL_DMA_SetPeriphAddress(DMAx, Channel, DMA_InitStruct->PeriphOrM2MSrcAddress);

  /*--------------------------- DMAx CHNDATAx Configuration -------------------------
   * Configure the peripheral base address with parameter :
   * - NbData:                    DMA_CHNDATA_NDATAx[15:0] bits
   */
  DDL_DMA_SetDataLength(DMAx, Channel, DMA_InitStruct->NbData);

  return SUCCESS;
}

#endif /* DMA1_Stream0 || DMA1_Stream1 || DMA1_Stream2 || DMA1_Stream3 || DMA1_Stream4 || DMA1_Stream5 || DMA1_Stream6 || DMA1_Stream7 */
       /* DMA2_Stream0 || DMA2_Stream1 || DMA2_Stream2 || DMA2_Stream3 || DMA2_Stream4 || DMA2_Stream5 || DMA2_Stream6 || DMA2_Stream7 */

/**
  * @brief  Set each @ref DDL_DMA_InitTypeDef field to default value.
  * @param  DMA_InitStruct Pointer to a @ref DDL_DMA_InitTypeDef structure.
  * @retval None
  */
void DDL_DMA_StructInit(DDL_DMA_InitTypeDef *DMA_InitStruct)
{
  /* Set DMA_InitStruct fields to default values */
  DMA_InitStruct->PeriphOrM2MSrcAddress  = 0x00000000U;
  DMA_InitStruct->MemoryOrM2MDstAddress  = 0x00000000U;
  DMA_InitStruct->Direction              = DDL_DMA_DIRECTION_PERIPH_TO_MEMORY;
  DMA_InitStruct->Mode                   = DDL_DMA_MODE_NORMAL;
  DMA_InitStruct->PeriphOrM2MSrcIncMode  = DDL_DMA_PERIPH_NOINCREMENT;
  DMA_InitStruct->MemoryOrM2MDstIncMode  = DDL_DMA_MEMORY_NOINCREMENT;
  DMA_InitStruct->PeriphOrM2MSrcDataSize = DDL_DMA_PDATAALIGN_BYTE;
  DMA_InitStruct->MemoryOrM2MDstDataSize = DDL_DMA_MDATAALIGN_BYTE;
  DMA_InitStruct->NbData                 = 0x00000000U;
  DMA_InitStruct->Priority               = DDL_DMA_PRIORITY_LOW;
#if defined (DMA_SCFGx_CHSEL)
  DMA_InitStruct->Channel                = DDL_DMA_CHANNEL_0;
  DMA_InitStruct->FIFOMode               = DDL_DMA_FIFOMODE_DISABLE;
  DMA_InitStruct->FIFOThreshold          = DDL_DMA_FIFOTHRESHOLD_1_4;
  DMA_InitStruct->MemBurst               = DDL_DMA_MBURST_SINGLE;
  DMA_InitStruct->PeriphBurst            = DDL_DMA_PBURST_SINGLE;
#endif /* DMA_SCFGx_CHSEL */
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* DMA1 || DMA2 */

/**
  * @}
  */

#endif /* USE_FULL_DDL_DRIVER */

